Tekla.Structures.Plugins.DirectManipulation.Services.Handles.SelectionEventArgs
Contains the event arguments for a drag event on a handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.SelectionEventArgs.State
Gets a value of the selection state.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.SelectionEventArgs.HitPosition
Gets a point indicating the position of the handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.SelectionEventArgs.#ctor(Tekla.Structures.Geometry3d.Vector,System.Boolean)
Constructs an instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Handles.SelectionEventArgs class
hitPosition: hit position.
isSelected: selection state.